# 0. Вывести квадрат числа
a = int(input('Введите число \n'))
print(f'Квадрат числа {a} равен {a**2}')
