# 3. Вывести на экран числа от -N до N
n = 4
for i in range(-n, n+1):
    print(i, end=' ')